# IFCParameter Template Remove Property Set Method

Source: https://www.revitapidocs.com/2026/f2bb1b32-a880-619b-9c7c-a92fc491e32a.htm

---

| IFCParameter Template Remove Property Set Method |
| --- |

Removes provided property set from the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void RemovePropertySet(
	PropertySetupType propertySetupType,
	string propertySetName
)
```

```
Public Sub RemovePropertySet (
	propertySetupType As PropertySetupType,
	propertySetName As String
)
```

```
public:
void RemovePropertySet(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
```

```
member RemovePropertySet :
        propertySetupType : PropertySetupType *
        propertySetName : string -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | A property set with the given name is not present in the template. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace